{
  "ch1_s1": {
    "text": "London fog clings to the Bald Crown like an accusation. Specter watches Jabez Wilson fidget with a coin under the weak tavern lamp. The man's red hair is a flare against the dim wood; his hands tremble more from fear than age. Wilson tells a strange tale about a society called the Red-Headed League that paid him to copy an encyclopedia but vanished overnight.\n\n\"Where were you? I was looking for you,\" Wilson says, voice thick with a pleading that smells of trouble.\n\nSpecter notes pockets, posture, and the way Wilson keeps glancing at the street. He suspects the League is more than a joke; he suspects someone wanted it to look like one.",
    "choices": [
      {
        "label": "Visit the former League offices with Wilson",
        "next": "ch1_s2"
      },
      { "label": "Investigate the League independently", "next": "ch1_s3" }
    ]
  },

  "ch1_s2": {
    "text": "The sign at Pope's Court swings and rasps in the wind. Specter pushes the door and finds a single chair, a layer of dust, and the smell of someone who left in a hurry. He kneels and finds a scrap folded under the chair leg—a red hand gripping a key scratched into its face. Wilson paces, useless and frightened.\n\n\"They told me to copy until the sun set, then pay me twice what I earned,\" Wilson blurts, eyes on the scrap as if it might bite.\n\nSpecter pockets the paper. The sigil isn't common; whoever used it wanted it noticed only by those who already knew how to read scars.",
    "choices": [
      { "label": "Follow the symbol to the city registry", "next": "ch1_s4" },
      { "label": "Question Wilson more aggressively", "next": "ch1_s5" }
    ]
  },

  "ch1_s3": {
    "text": "Specter visits the Gazette archives alone where ink and dust keep the city's small betrayals. He sifts notices until a private entry with the Red Hand Sigil surfaces—then vanishes from the record. Clerks murmur about deliberate erasure; someone in power scrubbed it out. That erasure smells like politics and money working together.\n\n\"You never saw them? Not even once?\" he asks a clerk who shrugs like a man who has learned the meaning of silence.\n\nSpecter leaves with a fingerprint of a conspiracy: the League left a mark and a clean hand erased it.",
    "choices": [
      {
        "label": "Cross-reference the sigil with police files",
        "next": "ch1_s4"
      },
      { "label": "Search for witnesses near Pope's Court", "next": "ch1_s5" }
    ]
  },

  "ch2_s1": {
    "text": "Specter steps into the chamber and every hooded head pivots toward his lantern glow. The vault at the center hums with a low metallic pulse. Red symbols are carved into it, old enough to predate the bricks around them. A man with a silver-threaded robe raises his hand, signaling an uneasy halt.\n\n\"You walk in the wrong place, detective. London forgets those who trespass,\" the man says, his tone almost gentle.\n\nSpecter studies their formation. Not thugs. Not zealots. Something in-between: men who believe their purpose outweighs their sins.",
    "choices": [
      { "label": "Demand to know what the League protects", "next": "ch2_s3" },
      {
        "label": "Pretend to negotiate and lower their guard",
        "next": "ch2_s4"
      }
    ]
  },

  "ch2_s2": {
    "text": "Specter retreats into the shadows, watching the ritual unfold. The hooded figures chant in low measure, hands moving in synchronized arcs. The vault emits a faint red glow, as if something inside responds to their rhythm. One of the men steps forward and places a folded document at the vault's base.\n\n\"The councilman delivered the final approvals. The city belongs to us beneath the streets,\" he mutters, unaware Specter listens.\n\nPolitics and occultism braided into a single rope—enough to hang the whole city if pulled wrong.",
    "choices": [
      { "label": "Steal the document after the ritual ends", "next": "ch2_s5" },
      { "label": "Follow the councilman lead above ground", "next": "ch2_s6" }
    ]
  },

  "ch2_s3": {
    "text": "Specter steps closer to the vault, boots echoing across stone. The robed leader tilts his head, amused but wary. He gestures toward inscriptions etched around the vault's curve. Symbols spiral inward like a story told in reverse.\n\n\"We protect the knowledge your city built itself upon,\" the man explains. \"Kings, clerks, and criminals all begged for what lies inside. None deserved it. Do you?\"\n\nSpecter doesn't answer. Questions are better weapons when kept sheathed.",
    "choices": [
      { "label": "Push closer and challenge the leader", "next": "ch2_s7" },
      { "label": "Pretend curiosity and probe their motives", "next": "ch2_s4" }
    ]
  },

  "ch2_s4": {
    "text": "Specter softens his posture, letting his lantern dip as if in concession. A few figures relax their grip on hidden blades. The leader circles him, examining Specter like a relic himself.\n\n\"You understand balance, detective. We need balance more than loyalty,\" the leader says.\n\nSpecter notes a sigil tattoo on the man's wrist—half faded, half renewed. A sign of someone trapped between politics and something older.",
    "choices": [
      {
        "label": "Offer to assist them and gain access to the vault",
        "next": "ch2_s7"
      },
      {
        "label": "Exploit their trust and slip toward a side tunnel",
        "next": "ch2_s6"
      }
    ]
  },

  "ch2_s5": {
    "text": "Specter waits until the chanting wanes and the chamber empties. He slips from the shadows and retrieves the folded document left at the vault's base. Inside is a coded blueprint of London’s undercity with red marks showing influence routes, bribed officials, and a tunnel yet unopened.\n\n\"Someone paid dearly to keep this hidden,\" he mutters as he pockets it.\n\nThe blueprint points to the Old Mint district—a place where money once meant power and still does.",
    "choices": [
      { "label": "Head to the Old Mint tunnels", "next": "ch2_s7" },
      { "label": "Confront the bribed councilman", "next": "ch2_s6" }
    ]
  },

  "ch2_s6": {
    "text": "Specter emerges from the tunnels and heads to the councilman's manor where candlelight leaks through tall windows. He watches servants shuffle with urgency uncommon for the hour. Inside, documents burn in a fireplace—an attempt to erase something vital.\n\n\"Specter? Here? Now? You should have stayed underground,\" a voice snaps from behind him.\n\nThe councilman stands armed with a small pistol, his hand trembling—not from fear, but from too much knowledge carried too long.",
    "choices": [
      {
        "label": "Disarm the councilman and interrogate him",
        "next": "ch2_s8"
      },
      { "label": "Leave him and pursue what he was burning", "next": "ch2_s5" }
    ]
  },

  "ch2_s7": {
    "text": "The deep tunnels below the Old Mint hum with a metallic vibration. Specter finds a secondary vault door etched with the same sigil but older, sharper. The air crackles faintly around it—like the relic inside is breathing against its stone cradle. Footsteps echo behind him, familiar and nervous.\n\n\"Specter, you shouldn't be here,\" Wilson says, face pale as candlewax.\n\nSpecter realizes Wilson wasn't followed—Wilson guided them.",
    "choices": [
      { "label": "Press Wilson for the truth", "next": "ch3_s1" },
      { "label": "Ignore him and open the secondary vault", "next": "ch3_s2" }
    ]
  },

  "ch2_s8": {
    "text": "Specter forces the pistol from the councilman's hand and tosses it into the fire. The man collapses into a chair, trembling as though a weight finally slipped from his shoulders.\n\n\"We didn't join them,\" the councilman mutters. \"We feared them. The League doesn't want relics—they want the city shaped to their vision. And that vision requires the hand awakened.\"\n\nSpecter pockets a surviving fragment of the burned documents: a diagram of the relic with notes in an unfamiliar script.",
    "choices": [
      { "label": "Take the fragment to the tunnels", "next": "ch3_s2" },
      { "label": "Press the councilman for names", "next": "ch3_s1" }
    ]
  },

  "ch1_s4": {
    "text": "At the registry, a man unlocks a cabinet with keys that rattle like old teeth. He reveals twine-bound files stamped with warnings older than most living men. The red hand appears on a ledger alongside names of city clerks, minor councilmen, and a few bankkeepers. The clerk's knuckles whiten when Specter mentions tunnels beneath the Old Quarter.\n\n\"We kept them from the public eye for a reason,\" the clerk says, voice low as a cellar door.\n\nSpecter feels a map of power unfold: occult custodianship braided with city politics. The League guarded something; now someone wants it moved.",
    "choices": [
      { "label": "Go underground through old sewer access", "next": "ch1_s6" },
      { "label": "Return to press Wilson for more detail", "next": "ch1_s5" }
    ]
  },

  "ch1_s5": {
    "text": "Wilson's pawnshop smells of metal and small betrayals. He admits he saw a locked room once, voice dropping when he says the crowd spoke in clipped syllables that set his teeth on edge. He remembers a map pinned to a board with red circles marking tunnels and a single vault marked by a hand.\n\n\"They promised protection for a simple job. I never thought they meant this,\" Wilson confesses, hands shaking as he counts a handful of pennies.\n\nSpecter believes the man more than he likes; fear has a truth that lies rarely carry.",
    "choices": [
      { "label": "Search Wilson's pawnshop for hidden maps", "next": "ch1_s6" },
      { "label": "Go underground immediately", "next": "ch1_s6" }
    ]
  },

  "ch1_s6": {
    "text": "The old tunnels breathe wet and slow. Specter's lantern throws a circle of light across stone steps carved before the railways. Red chalk marks lead into narrower passages; the sound of distant chanting threads the air like a low seam of threat. He follows until a chamber opens where hooded figures kneel around a vault, their gestures precise and practiced.\n\n\"Who comes at the hour of the ritual?\" a voice demands, and the hooded figures turn as one.\n\nSpecter already knows the answers he will accept are few: break the relic and scatter the League, walk away with its knowledge, or find himself trapped where loyalty and power make monsters of men.",
    "choices": [
      { "label": "Confront the chanters directly", "next": "ch2_s1" },
      { "label": "Observe quietly and retreat for a plan", "next": "ch2_s2" }
    ]
  },
  "ch3_s1": {
    "text": "Wilson trembles in the tunnel torchlight, sweat carving thin tracks through the grime on his face. Specter grips him by the coat and drags him deeper into the Old Mint's buried passages. The air vibrates with a dull hum, the kind that speaks of metal, pressure, and old promises. Wilson's eyes dart everywhere but Specter's face.\n\n\"I didn't betray you. Not fully. They said they'd spare me if I brought you close. I swear it,\" Wilson blurts, voice cracking under its own weight.\n\nSpecter studies him, trying to decide whether he's a coward, a pawn, or something far worse.",
    "choices": [
      { "label": "Press Wilson further", "next": "ch3_s3" },
      { "label": "Leave Wilson and approach the vault alone", "next": "ch3_s2" }
    ]
  },

  "ch3_s2": {
    "text": "The secondary vault looms before Specter like a lung carved from stone. Symbols spiral across its face, red pigment filling ancient grooves. A faint glow leaks from the seams, pulsing like a heartbeat. The relic inside—whatever shape it takes—calls to something primal in the air. Specter presses his palm to the cold surface.\n\n\"The hand responds to the worthy, not the willing,\" a voice echoes from behind him.\n\nOne of the hooded figures steps forward, weapon sheathed, posture unreadable. Not hostile—yet not friendly either.",
    "choices": [
      { "label": "Open the vault", "next": "ending_revelation" },
      {
        "label": "Shadow the hooded figure and learn their plan",
        "next": "ending_shadows"
      }
    ]
  },

  "ch3_s3": {
    "text": "Specter shoves Wilson against the stone and watches him buckle. The man weeps not from pain but resignation. Beyond him, voices echo—members of the League descending the steps in a slow and deliberate rhythm. Their silhouettes bloom in the lantern haze like a procession.\n\n\"You brought him, good. The relic awakens with fear and truth,\" one of them intones.\n\nWilson meets Specter's eyes then—not with apology, but with the calm of a man who made the wrong deal on the wrong night.",
    "choices": [
      {
        "label": "Turn on Wilson and fight your way out",
        "next": "ending_betrayal"
      },
      {
        "label": "Step forward and claim guardianship of the relic",
        "next": "ending_guardian"
      }
    ]
  },

  "ending_revelation": {
    "text": "Specter steps into the chamber, lantern held like a small rebellion. Hooded figures surge forward with a sound like leather and oath. The relic—a hand clutching a bone key—gleams with a light that makes the air taste metallic. Specter lifts his lantern high and, with a single, brutal swing from a broken length of pipe, he shatters the relic against the stone.\n\n\"You don't know what you've done,\" someone hisses, voice ragged with disbelief.\n\nThe chanting dies, the vault's glow gutters, and the League collapses into furious, leaderless scrambling. Specter walks out into London rain; the threat is scattered, not slain. CASE CLOSED — REVELATION",
    "ending": true
  },

  "ending_shadows": {
    "text": "Specter watches as the ritual completes, the hooded figures reverent and careful. The relic rests like a sleeping thing in the vault, pages and scrolls whispering around it. He steps back into the dark and closes the passage behind him, carrying only memories and a stolen list of names.\n\n\"Keep quiet, and you'll survive longer than those who shout,\" a departing figure murmurs as the steps swallow his silhouette.\n\nSpecter returns to the city with knowledge that eats at him in private hours. He keeps the secret and the men who would wield it keep hunting. CASE CLOSED — SHADOWS",
    "ending": true
  },

  "ending_betrayal": {
    "text": "Wilson's eyes are old and empty as he turns his hand toward the robed men. For a beat Specter sees the boy who wanted easy coin; then the man who chose survival. The hooded figures seize Wilson with practiced movements. In the confusion someone slams a lever and the tunnel trembles.\n\n\"We promised him safety for the name, and he kept his promise,\" the leader intones, as stone grinds and dust falls.\n\nSpecter fights, but the passage collapses behind him and the relic vanishes with Wilson into the earth. The city never learns what lay beneath that night. CASE CLOSED — BETRAYAL",
    "ending": true
  },

  "ending_guardian": {
    "text": "Specter lays down his lantern and says nothing for a long minute, letting the silence do the work of truth. He speaks not with force but with a proposition—safety for the city in exchange for stewardship. The elders argue like judges over a life; finally, they nod, not because they trust him but because they fear the alternatives.\n\n\"Take it into the daylight when you must. Keep it buried when you can,\" the leader tells him, pressing a red-marked token into Specter's palm.\n\nSpecter becomes something like a guardian: watched by some, trusted by none, and needed by many. He wears the role like a coat with too many pockets. CASE CLOSED — GUARDIAN",
    "ending": true
  }
}
